
 gcc -g p3original.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x800: file p3original.c, line 36.
(gdb) r
Starting program: /home/runner/Test2Session2-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3original.c:36
36    n=input_number();
(gdb) n
enter a number:3
37    ispr=is_prime(n);
(gdb) n
38    output(n,ispr);
(gdb) s
output (n=3, is_prime=0) at p3original.c:24
24    if (is_prime==1)
(gdb) p
The history is empty.
(gdb) c
Continuing.
3 is a prime number[Inferior 1 (process 64) exited normally]
(gdb) l
19              
20
21  }
22  void output(int n,int is_prime)
23  {
24    if (is_prime==1)
25    {
26      printf("%d is not a prime number",n);
27    }
28    else
(gdb)
