
 gcc -g p4original.c -lm
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x831: file p4original.c, line 32.
(gdb) r
Starting program: /home/runner/Test2Session2-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p4original.c:32
32      n=input();
(gdb) n
Enter the number
2
34      fibo = find_fibo(n);
(gdb) n
35      output(n,fibo);
(gdb) n
36      return 0;
(gdb) s
37    }(gdb) p
The history is empty.
(gdb) c
Continuing.
2th fibonacci number is 0[Inferior 1 (process 228) exited normally]
(gdb) l
32      n=input();
33      int fibo;
34      fibo = find_fibo(n);
35      output(n,fibo);
36      return 0;
37    }(gdb) 
